In [9]:
import sqlite3
drop_query='DROP TABLE IF EXISTS student_data;'
create_query='''CREATE TABLE student_data
                (student_id INT UNIQUE, 
                 student_name VARCHAR(80),
                 grade VARCHAR(2)
                 
                )'''
connection=sqlite3.connect('example2.db')
connection.execute(drop_query)
connection.execute(create_query)
connection.commit()

In [10]:
data=[(1,'sam','A'),
      (2,'ram','D'),
      (3,'liam','E'),
      (4,'Tim','B')]

insert_query='INSERT INTO student_data VALUES(?,?,?)'
connection.executemany(insert_query,data)
connection.commit()

In [14]:
selection_query="SELECT * FROM student_data where grade='A';"

In [15]:
import pandas as pd
retrieved= pd.read_sql_query(selection_query,connection)
retrieved

   student_id student_name grade
0           1          sam     A

In [34]:
connection.close()

In [80]:
import sqlite3

In [81]:
#create a connection to a database: in this case, newly made
conn=sqlite3.connect('employee.db')

In [82]:
#create a cursor 

c=conn.cursor()

In [101]:
c.execute("DROP TABLE IF EXISTS employee;")
c.execute("""CREATE TABLE employee (
              first TEXT,
              last TEaXT,
              pay INTEGER);""")

conn.commit()

In [109]:
c.execute("""INSERT INTO employee VALUES('Mary','Schafer',50000);"""
          )
c.execute("""INSERT INTO employee VALUES('Paul','Schafer',50000);"""
          )
conn.commit()

In [111]:
c.execute("SELECT * FROM employee where last = 'Schafer';")
print(c.fetchall())
conn.commit()

[('Mary', 'Schafer', 50000), ('Paul', 'Schafer', 50000)]

In [112]:
conn.close()

# using class and functions

In [139]:
class Employee:
    def __init__(self,first,last,pay):
        self.first=first
        self.last=last
        self.pay=pay

In [140]:
conn=sqlite3.connect('employee2.db')
c=conn.cursor()

In [141]:
c.execute("DROP TABLE IF EXISTS employees;")
c.execute("""CREATE TABLE employees (
              first TEXT,
              last TEaXT,
              pay INTEGER);""")

conn.commit()

In [142]:
emp1=Employee('John','Doe',80000)
emp2=Employee('Jane','Doe',90000)

# CREATE FUNCTIONS

in the insert function,
a dictionary ('inside curly braces') is passed into employees

In [143]:
def insert_emp(emp):
    with conn:
        c.execute("INSERT INTO employees VALUES(:first,:last,:pay)",
                  {'first':emp.first,'last':emp.last,'pay':emp.pay})

SELECT FUNCTION,
argument passed to dictionary and then passed to function

In [144]:
def get_emps_by_name(lastname):
    with conn:
        c.execute("SELECT * FROM employees where last =:last",
                  {'last':lastname})
        return c.fetchall()

In [145]:
insert_emp(emp1)
insert_emp(emp2)

In [146]:
get_emps_by_name('Doe')

[('John', 'Doe', 80000), ('Jane', 'Doe', 90000)]